Revit 2027 API
CurveByPointsUtils.GetHostFace Method
 Gets the host face to which the CurveElement is added.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static Reference GetHostFace(
	CurveElement curveElem
)
Public Shared Function GetHostFace (
	curveElem As CurveElement
) As Reference
public:
static Reference^ GetHostFace(
	CurveElement^ curveElem
)
static member GetHostFace :
        curveElem : CurveElement -> Reference
Parameters
curveElem CurveElement
 The CurveElement.
Return Value
Reference
 The host face to which the CurveElement is added, or an empty Reference if the host is not a face.
Exceptions
Exception | Condition
ArgumentException |  The input CurveElement is not a CurveByPoints.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
CurveByPointsUtils Class
Autodesk.Revit.DB Namespace